# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  #s: [0.33, 0.50, 1024]
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, ACmix, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, FasterNeXt, [512]]
  - [-1, 1, ACmix, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, FasterNeXt, [512]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0s head
head:
    - [ -1, 1, SimConv, [ 256, 1, 1 ] ] # 10
    - [ [ 4, 6, -1 ], 1, BiFusion, [ 256 ] ] #11
    - [ -1, 1, Conv, [ 256, 1, 1 ] ]
    - [ -1, 12, RepBlock, [ 256 ] ] #13

    - [ -1, 1, SimConv, [ 128, 1, 1 ] ]#14
    - [ [ 2, 4, -1 ], 1, BiFusion, [ 128 ] ]#15
    - [ -1, 1, Conv, [ 128, 1, 1 ] ]
    - [ -1, 12, RepBlock, [ 128 ] ]  #17

    - [ -1, 1, SimConv, [ 128, 3, 2 ] ]#18
    - [ [ -1, 14 ], 1, Concat, [ 1 ] ]
    - [ -1, 12, RepBlock, [ 256 ] ]  #20

    - [ -1, 1, SimConv, [ 256, 3, 2 ] ]#21
    - [ [ -1, 10 ], 1, Concat, [ 1 ] ]
    - [ -1, 12, RepBlock, [ 512 ] ]

    - [ [ 17, 20, 23 ], 1, Detect, [ nc ] ]  # Detect(P3, P4, P5)
